Repository: MariuszT/DiscoverPHP.com
Catalog: languages/*.po
Languages: pl_pl

source: source data for
pl_pl: dane źródłowe dla

source: result
pl_pl: rezultat

source: use
pl_pl: użyj

source: copy to
pl_pl: kopiuj do

source: DiscoverPHP.com is an open source project to learn Zend Framework. Come <a href="%s">here</a> for more informations.
pl_pl: DiscoverPHP.com to projekt o otwartym kodzie źródłowym do nauki Zend Framework. Chodź <a href="%s">tutaj</a> po więcej informacji.

source: Home
pl_pl: Główna

source: Genesis
pl_pl: Geneza

source: Download source
pl_pl: Pobierz źródło

source: Contact
pl_pl: Kontakt

source: select PHP function
pl_pl: wybierz funkcję PHP

source: PHP versions
pl_pl: Wersje PHP

source: Description
pl_pl: Opis

source: Manual
pl_pl: Pomoc

source: Sometimes you need to quickly use some functions in PHP such as base64_encode or generate the MD5 hash. Creating a new PHP script for such a trivial action is a waste of time. This page comes with the help. In a simple and quick way you can use many functions of PHP.
pl_pl: Czasami musisz szybko użyć jakiejś funkcji w PHP np. base64_encode lub wygenerować hash MD5. Tworzenie nowego skryptu PHP dla tak banalnych czynności jest stratą czasu. Ta strona przychodzi z pomocą. W prosty i szybki sposób możesz użyć wielu funkcji języka PHP.

source: None of the data that you enter in forms are stored in database!
pl_pl: Żadne dane, które wpisujesz w formularzach nie są zapisywane w bazie danych!

source: Page DiscoverPHP.com was created as a place to learn the <a href="http://framework.zend.com/" target="_blank">Zend Framework</a>. On the page "<a href="%s">Genesis</a>" you can read more about it and on the page "<a href="%s">Download source</a>" you can download the source code.
pl_pl: Strona DiscoverPHP.com została stworzona jako miejsce do nauki <a href="http://framework.zend.com/" target="_blank">Zend Framework</a>. Na stronie "<a href="%s">Geneza</a>" możesz poczytać o tym więcej a na stronie "<a href="%s">Pobierz źródło</a>" możesz pobrać kod źródłowy.

source: Zend Framework is a powerful tool. Unfortunately, its complexity makes it difficult to start working. I decided to learn the Zend Framework on a specific project. This is how DiscoverPHP.com was created.<br /><br />On the internet you can find examples of simple or very complex applications. Missing something intermediate. I would like to fill this gap, so I decided to release the source code of DiscoverPHP.com.
pl_pl: Zend Framework jest potężnym narzędziem. Niestety, jego złożoność sprawia, że rozpoczęcie pracy z nim jest trudne. Postanowiłem uczyć się Zend Framework na konkretnym projekcie. Tak powstała strona discoverphp.com.<br /><br />W internecie można znaleźć proste lub bardzo złożone przykłady zastosowań. Brakuje czegoś pośredniego. Chciałbym wypełnić tą lukę, dlatego zdecydowałem się udostępnić kod źródłowy discoverphp.com.

source: I've used on this page HTML5 and CSS 3. I did it with premeditation so if something don't work or look bad, update/change your browser.
pl_pl: Użyłem na tej stronie HTML5 i CSS 3. Zrobiłem to z premedytacją więc jeżeli coś nie działa lub wygląda źle, zaktualizuj/zmień swoją przeglądarkę.

source: What can you learn from the code
pl_pl: Czego możesz się nauczyć z kodu

source: basic configuration
pl_pl: podstawowa konfiguracja

source: how to use %s
pl_pl: jak używać %s

source: how to build own helpers
pl_pl: jak budować własne helpery

source: how to build own plugins
pl_pl: jak budować własne pluginy

source: HTML5 and CSS 3
pl_pl: HTML5 i CSS 3

source: and many, many more
pl_pl: i wiele, wiele więcej

source: TODO list
pl_pl: Lista do zrobienia

source: add comments
pl_pl: dodać komentarze

source: split application into modules (and add admin module)
pl_pl: podzielić aplikację na moduły (i dodać moduł admina)

source: use %s
pl_pl: użyć %s

source: use %s and %s
pl_pl: użyć %s i %s

source: and it is only the beginning
pl_pl: i to tylko początek

source: Used version of Zend Framework
pl_pl: Użyta wersja Zend Framework

source: Go for the
pl_pl: Idź po

source: source code
pl_pl: kod źródłowy

source: DiscoverPHP.com is an open source project written in Zend Framework (PHP). Here you can get source files.
pl_pl: DiscoverPHP.com to projekt o otwartym kodzie źródłowym, napisany w Zend Framework (PHP). Tutaj możesz pobrać pliki źródłowe.

source: latest version
pl_pl: najnowsza wersja

source: If you need to contact me, please use this email address
pl_pl: Jeżeli musisz się ze mną skontaktować, proszę użyj tego adresu e-mail

source: Oops! An error occurred
pl_pl: Ups! Wystąpił błąd

source: Hello! This is an error page
pl_pl: Witaj! To jest strona błędu

source: Page not found
pl_pl: Strona nie została znaleziona

source: Application error
pl_pl: Błąd aplikacji

source: Quote string with slashes
pl_pl: Dodaje znak ucieczki przed znakami niebezpiecznymi

source: Returns a string with backslashes before characters that need to be quoted in database queries etc. These characters are single quote ('), double quote (&quot;), backslash (\) and NUL (the NULL byte).
pl_pl: Zwraca ciąg znaków, który został zabezpieczony przed niebezpiecznymi znakami, znakiem ucieczki '\' (back slash) co jest potrzebne w zapytaniach do bazy danych etc. Te znaki zapytania to pojedynczy cudzysłów ('), podwójny cudzysłów (&quot;), backslash (\) i NUL (bajt NULL).

source: Decodes data encoded with MIME base64
pl_pl: Dekoduje dane zakodowane algorytmem MIME base64

source: Decodes a base64 encoded data.
pl_pl: Dekoduje dane zakodowane przez base64.

source: Encodes data with MIME base64
pl_pl: Koduje dane za pomocą algorytmu MIME base64

source: Encodes the given data with base64.<br /><br />This encoding is designed to make binary data survive transport through transport layers that are not 8-bit clean, such as mail bodies.<br /><br />Base64-encoded data takes about 33% more space than the original data.
pl_pl: Zwraca dane zakodowane za pomocą algorytmu base64.<br /><br />Ten sposób kodowania został zaprojektowany, aby móc bezpiecznie przesyłać dane binarne, poprzez warstwy transportujące nie zaprojektowane do obsługi 8 bitowego przesyłania informacji, np. treść emaili.<br /><br />Dane zakodowane tą funkcją zajmują ok 33% więcej miejsca niż dane oryginalne.

source: Convert binary data into hexadecimal representation
pl_pl: Konwertuje wartość w formacie binarnym na hexadecymalny

source: Returns an ASCII string containing the hexadecimal representation of string. The conversion is done byte-wise with the high-nibble first.
pl_pl: Zwraca string ASCII zawierający hexadecymalną reprezentację stringa.

source: Calculates the crc32 polynomial of a string
pl_pl: Oblicza crc32 wielomian z ciągu

source: Generates the cyclic redundancy checksum polynomial of 32-bit lengths of the string. This is usually used to validate the integrity of data being transmitted.<br /><br />Because PHP's integer type is signed, and many crc32 checksums will result in negative integers, you need to use the &quot;%u&quot; formatter of sprintf() or printf() to get the string representation of the unsigned crc32 checksum.
pl_pl: Generuje z łańcucha znaków cykliczną nadmiarową sumę kontrolną wielomianu o długości 32 bitów. Jest to zwykle wykorzystywane do sprawdzania integralności przekazywanych danych.<br /><br />Ponieważ typ integer w PHP jest liczbą całkowitą i wiele sum kontrolnych crc32 jest ujemnych, należy użyć formatu &quot;%u&quot; w sprintf() lub printf() aby uzyskać dodatnią reprezentację ciągu sumy kontrolnej crc32.

source: Split a string by string
pl_pl: Rozbija ciąg znaków za pomocą innego ciągu znaków

source: Returns an array of strings, each of which is a substring of string formed by splitting it on boundaries formed by the string delimiter.
pl_pl: Zwraca tablicę ciągów znaków gdzie każdy z tych ciągów znaków jest częścią wejściowego ciągu znaków i każdy z tych ciągów powstał przez podzielenie wejściowego ciągu na granicy utworzonej przez ogranicznik ciągu.

source: Generate a hash value (message digest) with MD4 algorithm
pl_pl: Generuje zahashowaną (suma kontrolna) wartość algorytmem MD4

source: Returns a string containing the calculated message digest as lowercase hexits.
pl_pl: Zwraca łańcuch zawierający obliczony skrót wiadomości jako małe znaki szesnastkowe.

source: Calculate the MD5 hash of a string
pl_pl: Obliczanie sumy kontrolnej ciągu znaków za pomocą MD5

source: Calculates the MD5 hash of string using the RSA Data Security, Inc. MD5 Message-Digest Algorithm, and returns that hash.
pl_pl: Oblicza sumę kontrolną ciągu znaków za pomocą MD5 używając RSA Data Security, Inc. MD5 Message-Digest Algorithm i zwraca tą sumę kontrolną.

source: Calculate the metaphone key of a string
pl_pl: Obliczanie klucza metaphone ciągu znaków

source: Calculates the metaphone key of string.<br /><br />Similar to soundex() metaphone creates the same key for similar sounding words. It's more accurate than soundex() as it knows the basic rules of English pronunciation. The metaphone generated keys are of variable length.
pl_pl: Oblicza klucz metaphone ciągu znaków.<br /><br />Podobnie do soundex() metaphone tworzy taki sam klucz do podobno brzmiących słów. Jest to bardziej dokładne niż soundex(), ponieważ zna podstawowe zasady wymowy angielskiej. W metaphone generowane są klucze o zmiennej długości.

source: Inserts HTML line breaks before all newlines in a string
pl_pl: Wstawia tag HTML odpowiedzialny za łamanie linii przed wszystkimi nowymi liniami w ciągu znaków

source: Returns string with '&lt;br /&gt;' or '&lt;br&gt;' inserted before all newlines.
pl_pl: Zwraca ciąg znaków z '&lt;br /&gt;' lub '&lt;br&gt;' wstawionymi przed wszystkimi nowymi liniami.

source: Decodes a JSON string
pl_pl: Dekoduje ciąg znaków JSON

source: Takes a JSON encoded string and converts it into a PHP variable.
pl_pl: Bierze zakodowany ciąg znaków JSON a konwertuje go do zmiennej PHP.

source: Returns the JSON representation of a value
pl_pl: Zwraca reprezentację JSON danej wartości

source: Returns a string containing the JSON representation of value.
pl_pl: Zwraca ciąg znaków zawierający reprezentację JSON danej wartości.

source: Make a string's first character lowercase
pl_pl: Zamienia pierwsze znaki ciągu znaków na małe

source: Returns a string with the first character of string lowercased if that character is alphabetic.<br /><br />Note that 'alphabetic' is determined by the current locale. For instance, in the default &quot;C&quot; locale characters such as umlaut-a (ä) will not be converted.
pl_pl: Zwraca ciag znaków z małymi pierwszymi znakami jeżeli te znaki są alfabetyczne.<br /><br />Zauważ, że 'alfabetyczne' jest zależne od aktualnych ustawień regionalnych. Na przykład w domyślnym &quot;C&quot; regionalne znaki jak umlaut-a (ä) nie będą przekonwertowane.

source: Calculate the sha1 hash of a string
pl_pl: Obliczanie sumy kontrolnej ciągu znaków za pomocą sha1

source: Calculates the sha1 hash of string using the US Secure Hash Algorithm 1.
pl_pl: Oblicza sumę kontrolną ciągu znaków za pomocą sha1 używając Secure Hash Algorithm 1.

source: Generate a hash value (message digest) with sha256 algorithm
pl_pl: Generuje zahashowaną (suma kontrolna) wartość algorytmem sha256

source: Generate a hash value (message digest) with sha384 algorithm
pl_pl: Generuje zahashowaną (suma kontrolna) wartość algorytmem sha384

source: Generate a hash value (message digest) with sha512 algorithm
pl_pl: Generuje zahashowaną (suma kontrolna) wartość algorytmem sha512

source: Calculate the soundex key of a string
pl_pl: Obliczanie klucza soundex ciągu znaków

source: Calculates the soundex key of string.<br /><br />Soundex keys have the property that words pronounced similarly produce the same soundex key, and can thus be used to simplify searches in databases where you know the pronunciation but not the spelling. This soundex function returns a string 4 characters long, starting with a letter.
pl_pl: Oblicza klucz soundex ciągu znaków.<br /><br />Klucze soundex mają tą właściwość, że słowa wypowiadane w podobny sposób produkują taki sam klucz soundex a więc mogą być stosowane w celu uproszczenia wyszukiwania w bazach danych gdy znasz wymowę ale nie pisownię. Funkcja soundex zwraca łańcuch 4 znaków, począwszy od litery.

source: Perform the rot13 transform on a string
pl_pl: Wykona transformację ROT13 na ciągu znaków

source: Performs the ROT13 encoding on the string argument and returns the resulting string.<br /><br />The ROT13 encoding simply shifts every letter by 13 places in the alphabet while leaving non-alpha characters untouched. Encoding and decoding are done by the same function, passing an encoded string as argument will return the original version.
pl_pl: Wykonuje kodowanie ROT13 na ciągu znaków i zwraca rezultat w postaci ciągu znaków<br /><br />ROT13 koduje poprzez proste przesuwanie każdej litery o 13 miejsc w alfabecie pozostawiając nienaruszonym niealfanumeryczne znaki. Kodowanie i dekodowanie są dokonywane za pomocą tej samej funkcji, przekazanie zakodowanego ciągu znaków jako argument zwróci oryginalną wersję.

source: Randomly shuffles a string
pl_pl: Losową miesza ciąg znaków

source: str_shuffle() shuffles a string. One permutation of all possible is created.
pl_pl: str_shuffle() miesza ciąg znaków. Tworzona jest jedna permutacja ze wszystkich możliwości.

source: Return information about words used in a string
pl_pl: Zwraca informacje o wyrazach użytych w ciągu znaków

source: Counts the number of words inside string. If the optional format is not specified, then the return value will be an integer representing the number of words found. In the event the format is specified, the return value will be an array, content of which is dependent on the format.<br /><br />For the purpose of this function, 'word' is defined as a locale dependent string containing alphabetic characters, which also may contain, but not start with &quot;'&quot; and &quot;-&quot; characters.
pl_pl: Liczy liczbę wyrazów w ciągu znaków. Jeżeli opcjonalny format nie jest ustawiony, wtedy zwracana wartość będzie liczbą reprezentującą liczbę znalezionych wyrazów. Gdy format jest ustalony, zwracana wartość będzie tablicą, której zawartość zależy od formatu.<br /><br />Dla celów tej funkcji, 'wyraz' jest zdefiniowany jako ciąg zależny od lokalizacji zawierający znaki alfabetu, który również może zawierać ale nie zaczynać się od znaków &quot;'&quot; i &quot;-&quot;.

source: Strip HTML and PHP tags from a string
pl_pl: Usuwa tagi HTML i PHP z ciągu znaków

source: This function tries to return a string with all NUL bytes, HTML and PHP tags stripped from a given string. It uses the same tag stripping state machine as the fgetss() function.
pl_pl: Ta funkcja próbuje zwrócić ciąg znaków z usuniętymi z danego ciągu bajtami NUL, tagami HTML i PHP. Używa tego samego mechanizmu usuwania tagów co funkcja fgetss().

source: Un-quotes a quoted string
pl_pl: Usuwa znaki ucieczki z ciągu znaków

source: Un-quotes a quoted string.
pl_pl: Usuwa znaki ucieczki z ciągu znaków.

source: Get string length
pl_pl: Podaje długość ciągu znaków

source: Returns the length of the given string.
pl_pl: Zwraca długość podanego ciągu znaków.

source: Make a string lowercase
pl_pl: Zamienia litery w ciągu znaków na małe

source: Returns string with all alphabetic characters converted to lowercase.<br /><br />Note that 'alphabetic' is determined by the current locale. This means that in i.e. the default &quot;C&quot; locale, characters such as umlaut-A (Ä) will not be converted.
pl_pl: Zwraca ciąg znaków z wszystkimi alfabetycznymi znakami skonwertowanymi na małe.<br /><br />Zauważ, że 'alfabetyczne' jest zależne od aktualnych ustawień regionalnych. Na przykład w domyślnym &quot;C&quot; regionalne znaki jak umlaut-A (Ä) nie będą przekonwertowane.

source: Make a string uppercase
pl_pl: Zamienia litery w ciągu znaków na duże

source: Returns string with all alphabetic characters converted to uppercase.<br /><br />Note that 'alphabetic' is determined by the current locale. For instance, in the default &quot;C&quot; locale characters such as umlaut-a (ä) will not be converted.
pl_pl: Zwraca ciąg znaków z wszystkimi alfabetycznymi znakami skonwertowanymi na duże.<br /><br />Zauważ, że 'alfabetyczne' jest zależne od aktualnych ustawień regionalnych. Na przykład w domyślnym &quot;C&quot; regionalne znaki jak umlaut-a (ä) nie będą przekonwertowane.

source: Make a string's first character uppercase
pl_pl: Zamienia pierwsze litery ciągu znaków na duże

source: Returns a string with the first character of string capitalized, if that character is alphabetic.<br /><br />Note that 'alphabetic' is determined by the current locale. For instance, in the default &quot;C&quot; locale characters such as umlaut-a (ä) will not be converted.
pl_pl: Zwraca ciąg znaków z pierwszym dużym znakiem danego ciągu jeżeli ten znak jest alfabetyczny.<br /><br />Zauważ, że 'alfabetyczne' jest zależne od aktualnych ustawień regionalnych. Na przykład w domyślnym &quot;C&quot; regionalne znaki jak umlaut-a (ä) nie będą przekonwertowane.

source: Uppercase the first character of each word in a string
pl_pl: Zamienia pierwsze znaki na duże dla każdego wyrazu w ciągu znaków

source: Returns a string with the first character of each word in string capitalized, if that character is alphabetic.<br /><br />The definition of a word is any string of characters that is immediately after a whitespace (These are: space, form-feed, newline, carriage return, horizontal tab, and vertical tab).
pl_pl: Zwraca ciąg znaków z dużym znakiem dla każdego wyrazu w ciągu znaków jeżeli ten znak jest alfabetyczny.<br /><br />Definicja wyrazu to każdy ciąg znaków tuż po białym znaku (To są: spacja, wysunięcie strony, nowa linia, powrót karetki, horyzontalny poziomy i pionowy tabulator).

source: MIME base64 functions
pl_pl: funkcje MIME base64

source: hash functions: md4, sha256, sha384, sha512
pl_pl: funkcje hash: md4, sha256, sha384, sha512

source: JSON functions
pl_pl: funkcje JSON

source: operate on string case
pl_pl: operacje na wielkości znaków w stringach

source: Value is required and can't be empty
pl_pl: Wartość jest wymagana, nie może być pusta

source: Maximum length is %max% characters
pl_pl: Maksymalna długość to %max% znaków

source: FALSE - this is not base64 encoded data
pl_pl: FAŁSZ - to nie jest wartość zakodowane w base64

source: NULL - this is not JSON encoded data
pl_pl: NULL - to nie jest wartość zakodowana w JSON

source: genesis
pl_pl: geneza

source: source
pl_pl: zrodlo

source: contact
pl_pl: kontakt

source: english
pl_pl: angielski

source: polish
pl_pl: polski
